---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.SubSchemaGUID
source: html/67059117-db52-19c0-ba09-cc2860ddde2e.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.SubSchemaGUID Property

The GUID of the Schema describing the subentity (or subentities) stored in this Field.

## Syntax (C#)
```csharp
public Guid SubSchemaGUID { get; }
```